//#include "../Inc/init.h";
#include <stdint.h>
int main(void)
{
    *(uint32_t *)(0x40023800UL + 0x30UL) |= 0x02UL + 0x04UL; // включение тактирования для переферии GPIOB, регистр AHB1ENR

    *(uint32_t *)(0x40020400UL + 0x00UL) |= 0x4000UL;   // настройка редима работы порта на выход, регистр  MODER
    *(uint32_t *)(0x40020400UL + 0x04UL) &= ~0x80UL;     // настройка порта выхода пина PB7 на push-pull, регистр OTYPER
    *(uint32_t *)(0x40020400UL + 0x08UL) |= 0x4000UL;     // настройка скорости работы на среднюю, регистр OSPEEDR

    *(uint32_t *)(0x40020400UL + 0x18UL) |= 0x800000UL; // предварительное отключение светодиода регистр BSRR

    while (1)
    {
        if (*(uint32_t *)(0x40020800 + 0x10UL) & 0x1000UL){
            *(uint32_t *)(0x40020400UL + 0x18UL) |= 0x80UL; //  включение светодиода регистр BSRR
        }
        else{
            *(uint32_t *)(0x40020400UL + 0x18UL) |= 0x800000UL; //выключение светодиода регистр BSRR
        }
    }
}